Revit 2027 API
DocumentSavingAsEventArgs Properties
The DocumentSavingAsEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPreDocEventArgs)
IsSavingAsCentralFile |  Indicates whether the document is to be saved as central file.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
PathName |  Target path to which the document is to be saved.
Top
See Also
Reference
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace